# 🧠 آموزش توابع (functions)
# تابع یا Function یک بلوک کد قابل استفاده مجدد است.
# با استفاده از تابع، می‌تونیم یک کاری رو فقط یک‌بار بنویسیم ولی هر چند بار خواستیم اجراش کنیم.

# ----------------------------------------
# 🔹 تعریف یک تابع ساده

def say_hello():
    print("سلام! خوش اومدی.")

# 🔹 صدا زدن تابع
say_hello()

# ----------------------------------------
# 🔹 تابع با ورودی (parameter)

def greet_user(name):
    print("سلام", name)

greet_user("مبین")
greet_user("زهرا")

# ----------------------------------------
# 🔹 تابع با خروجی (return)

def square(number):
    return number * number

result = square(4)
print("توان دوم:", result)

# ----------------------------------------
# 🔹 تابع با چند ورودی

def add(a, b):
    return a + b

print("جمع:", add(5, 8))

# ----------------------------------------
# 🔹 تابع با مقدار پیش‌فرض برای پارامتر

def welcome(name="کاربر"):
    print("خوش آمدی", name)

welcome()            # استفاده از مقدار پیش‌فرض
welcome("مونا")      # مقدار جدید

# ----------------------------------------
# 🔹 تابع تو در تو (nested functions)

def outer():
    print("تابع بیرونی")

    def inner():
        print("تابع داخلی")

    inner()

outer()

# ----------------------------------------
# 🔹 تابعی که عددی بگیره و بگه زوج هست یا فرد

def even_or_odd(n):
    if n % 2 == 0:
        return "عدد زوج است"
    else:
        return "عدد فرد است"

print(even_or_odd(7))
print(even_or_odd(12))
